#include <iostream>
using namespace std;

int main() {
    int z,x;  // Наші змінні z та х (вводимо з клавіатури в 7 рядку)

    cout << "Vvedit x " << endl;
    cin >> x;

    cout << "X = " << x; // На друк виводимо значення вхідної змінної

    int y = 3*x+4; // Наш y за умовою 1 лабораторної 1 завдання,яке підставляємо у вираз
    z= x - 5 * y; // Наш вираз за умовою 1 лабораторної 1 завдання, перевіряємо на правильність відповідь

    cout << "Result = " << z; // Виводимо результат :)
    return 0;
}
