#include <iostream>
using namespace std;

int main() {
    int a; // число яке ми будемо перевіряти на "досконалість"
    int sum; // змінна, в яку ми будемо додавати всі "досконалі"


    // Досконале число - це натуральне число,
    // сума всіх його справжніх дільників (крім самого числа)
    // дорівнює самому цьому числу, і всі відомі досконалі числа є парними.
    // тобто дивлячись на приклад числа 6, ми можемо сказати, що воно досконале
    // тому що дільники: 1, 2, 3; Ми їх додаємо (1 + 2 + 3) = 6. Далі ви все зрозумієте

    cout <<"Write your number" <<endl;
    cin >> a;// очевидно, що ми тут ввели число
    for (int i = 1; i < a; i++) {
        if (a % i == 0){
            sum += i;
        }
        //коли ми знаходимо число, яке ділиться без остачі на наше введене "а"
        //(згадуємо приклад про цифру 6, якщо ми 6/3=2, і ділиться воно без остачі), то ми це число повинні врахувати
        //(додаємо нашу 3-ку до 1 та 2, які так само діляться на 6 без остачі)
    }
    //виходимо з циклу з нашою сумою, та йдемо перевіряти, чи дійсно наша сума, куди ми додавали всі числа,
    //дорівнює числу "а"
    if (sum==a){ // "==" перевірка рівності тобто, повертаючись до прикладу, чи 6==6 - true, тобто правда
        cout <<"Number is right";
    }
    else{ // використовуємо стандартну структуру if else з попередніх лабораторних
        cout <<"Number is wrong";
    }
}
