#include <iostream>
using namespace std;

int main() {
    int number; // Задаємо функцію , яка допоможе в розв'язані цієї задачі
    for (int i = 1; i <= 9; i++) { // Робимо цикл в якому буде 999 чисел
        for (int j = 0; j <= 9; j++) { // Потім робимо ще один цикл в циклі , який нам заміняє другу змінну з формули.
            number = i * 100 + j * 10 + (i + j); // Виводимо формулу
            if (number >= 100 && number <= 999) { // Робимо if , який буде провіряти значення
                cout << number << " "; // Виводимо
            }
        }
    }
    return 0; // Ретурнуємо
}
